app/Http/Controllers/auth_controller.php

    public function create_account(Request $request){
        $validatedData = $request->validate([
            'id'=> 'required',
            'user_name' => 'required',
            'email' => 'required|email|unique:users',
            'password' => 'required|min:6',
            'role' => 'required',
            'name_establishment' => 'required'
        ]);
        $establishment = Establishment::create([
            'name_establishment' => $validatedData['name_establishment']
        ]);
        $user = User::create([
            'id'=>$validatedData['id'],
            'user_name' => $validatedData['user_name'],
            'email' => $validatedData['email'],
            'password' => bcrypt($validatedData['password']),
            'role' => $validatedData['role'],
            'establishment_id' => $establishment->id // Assigning the establishment's ID to the user's establishment_id
        ]);
---
insert into `establishment` (`name_establishment`) values ('test')
insert into `users` (`user_name`, `email`, `password`, `role`, `establishment_id`) values ('admin', 'ahmed.errebache1@gmail.com', '$2y$10$wPxPMWnezqTLdncsXEyxIuBnn9zQYDsePruQtFLFn0LTiZfdtNONy', 'admin', 2)