app/Http/Controllers/forgotPassword.php

select * from `users` where (`email` = 'ahmed.errebache1@gmail.com' and `role` = 'admin') limit 1
insert into `password_resets` (`email`, `token`, `created_at`) values ('ahmed.errebache1@gmail.com', 'uKGlGY2q9WilUfmeGVwmbEg2L', '2024-03-04 09:39:07')
---
    public function forgotPassword(Request $request){
        try{
                    // dd($request);
        $request->validate([
            'email'=>'required|email'
        ]);
        $user = User::where(['email'=> $request->email,'role'=>'admin'])->first();

        if(!$user){
            return redirect()->route('ForgotPassword')->withErrors(['errors'=>"Désolé, nous n'avons pas pu trouver votre compte."]);
        }
        $token = str::Random(25);
        DB::table('password_resets')->insert([
            'email'=>$request->email,
            'token'=>$token,
            'created_at'=>Carbon::now()
        ]);